# 1. Негизги образ: Python'дун 3.11.3 версиясын колдонобуз
FROM python:3.11.3-bullseye

# 2. Системалык жаңыртуу: Контейнердин ичиндеги пакеттерди жаңыртабыз
RUN apt-get update && apt-get upgrade -y

# 3. Жумушчу папка: Контейнердин ичинде '/app' деген папка түзүп, ошол жерде иштейбиз
WORKDIR /app

# 4. Тизмени көчүрүү: Керектүү китепканалардын тизмесин контейнерге салабыз
COPY requirements.txt ./requirements.txt

# 5. Орнотуу: Python үчүн керектүү бардык китепканаларды орнотобуз
RUN pip3 install -r requirements.txt

# 6. Долбоорду көчүрүү: Компьютердеги бардык коддорду контейнердин ичине көчүрөбүз
COPY . .